#include "DataProInterface.h"
#include "string.h"

/************************************************************************/
/* 构造函数                                                             */
/************************************************************************/
DataProInterface::DataProInterface()
{
	memset(m_szParams, 0x00, sizeof(m_szParams));
}

/************************************************************************/
/* 析构函数                                                             */
/************************************************************************/
DataProInterface::~DataProInterface()
{
}

/************************************************************************/
/* 初始化参数                                                           */
/************************************************************************/
int DataProInterface::SetParams(char * strParams)
{
	if (strParams == NULL)
	{
		return -1;
	}

	if (strlen(strParams) > 255)
	{
		return -2;
	}
#ifdef _WIN32
	strcpy_s(m_szParams, strParams); 
#else
	strcpy(m_szParams, strParams); 
#endif
	return 0;
}

/************************************************************************/
/* 返回配置参数                                                         */
/************************************************************************/
char* DataProInterface::GetParams()
{
	return m_szParams;
}

/************************************************************************/
/* 设置类型                                                             */
/************************************************************************/
void DataProInterface::SetType(int nType)
{
	m_nType = nType;
}

/************************************************************************/
/* 返回类型                                                             */
/************************************************************************/
int DataProInterface::GetType()
{
	return m_nType;
}

